There must be a regression then.
Using 3.3.0 and facing this issue:
https://registry.terraform.io/providers/newrelic/newrelic/latest/docs/resources/workflow#account_id says optional but it's required. I declare it inside the provider declaration, not per-resource.

```
  # newrelic_workflow.workflow must be replaced
-/+ resource "newrelic_workflow" "workflow" {
      - account_id            = (REDACTED) -> null # forces replacement
      ~ id                    = "1434fa59-xxxx-xxxx-xxxx-13402ba0c4c2" -> (known after apply)
      + last_run              = (known after apply)
        name                  = "Workflow"
      ~ workflow_id           = "1434fa59-xxxx-xxxx-xxxx-13402ba0c4c2" -> (known after apply)
...
```

Please reopen